# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [1, 0.5, 1024]  #



backbone:
  # [from, repeats, module, args]
  - [-1, 1, hiera3_tiny, []]  # 4
  - [-1, 1, SPPF, [1024, 5]]  # 5

head:
  # Reduce channels for feature pyramid
  - [ 1, 1, Conv, [ 128, 1, 1 ] ]  # 6  P2 -> 128 channels
  - [ 2, 1, Conv, [ 256, 1, 1 ] ]  # 7  P3 -> 256 channels
  - [ 3, 1, Conv, [ 512, 1, 1 ] ]  # 8  P4 -> 512 channels
  - [ 5, 1, Conv, [ 1024, 1, 1 ] ] # 9  P5 -> 1024 channels

  # Top-down pathway (FPN part)
  - [ 9, 1, nn.Upsample, [ None, 2, 'nearest' ] ]     # 10 upsample P5
  - [ [ 10, 8 ], 1, Concat, [ 1 ] ]                   # 11 concat P5_up + P4
  - [ 11, 3, C2f, [ 512, False ] ]                    # 12 fuse P4

  - [ 12, 1, nn.Upsample, [ None, 2, 'nearest' ] ]    # 13 upsample P4
  - [ [ 13, 7 ], 1, Concat, [ 1 ] ]                   # 14 concat P4_up + P3
  - [ 14, 3, C2f, [ 256, False ] ]                    # 15 fuse P3

  - [ 15, 1, nn.Upsample, [ None, 2, 'nearest' ] ]    # 16 upsample P3
  - [ [ 16, 6 ], 1, Concat, [ 1 ] ]                   # 17 concat P3_up + P2
  - [ 17, 3, C2f, [ 128, False ] ]                    # 18 fuse P2 (N2)

  # Bottom-up pathway (PANet part)
  - [ 18, 1, Conv, [ 128, 3, 2 ] ]                    # 19 downsample N2
  - [ [ 19, 15 ], 1, Concat, [ 1 ] ]                  # 20 concat N2_down + N3
  - [ 20, 3, C2f, [ 256, False ] ]                    # 21 fuse (N3)

  - [ 21, 1, Conv, [ 256, 3, 2 ] ]                    # 22 downsample N3
  - [ [ 22, 12 ], 1, Concat, [ 1 ] ]                  # 23 concat N3_down + N4
  - [ 23, 3, C2f, [ 512, False ] ]                    # 24 fuse (N4)

  - [ 24, 1, Conv, [ 512, 3, 2 ] ]                    # 25 downsample N4
  - [ [ 25, 9 ], 1, Concat, [ 1 ] ]                   # 26 concat N4_down + N5
  - [ 26, 3, C2f, [ 1024, False ] ]                   # 27 fuse (N5)

  # Detection heads for P2, P3, P4, P5
  - [ [ 18, 21, 24, 27 ], 1, Detect, [ nc ] ]         # 28 Detect(P2, P3, P4, P5)


