

# Parameters
nc: 3  # number of classes
scales: #
  # [depth, width, max_channels]
  n: [1, 1, 1024]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, hiera3, []]  # 4
  - [-1, 1, SPPF, [1024, 5]]  # 5

# YOLOv8.0n head
head:
  - [ 1, 1, Conv, [ 128, 1, 1 ] ]#6
  - [ 2, 1, Conv, [ 256, 1, 1 ] ]#7
  - [ 3, 1, Conv, [ 512, 1, 1 ] ]#8
  - [ 5, 1, Conv, [ 1024, 1, 1 ] ]#9
  - [[6,7,8,9], 1, Detect_AFPN_P2345_Custom, [nc, 256, 'RepConv']]


